[{"id":0,"name":"Tir","recruitment":"Joins your party at the very beginning of the game."},{"id":1,"name":"Cleo","recruitment":"Automatically joins at the beginning of the game."},{"id":2,"name":"Gremio","recruitment":"Automatically joins at the beginning of the game."},{"id":3,"name":"Viktor","recruitment":"Automatically joins after leaving Gregminster."},{"id":4,"name":"Mathiu","recruitment":"Joins automatically after Tir agrees to become leader of the Liberation Army."},{"id":5,"name":"Camille","recruitment":"Joins automatically after talking to her in Kaku."},{"id":6,"name":"Tai Ho","recruitment":"Joins Tir in Kaku after beating him at Chinchirorin before going to explore Toran Castle."},{"id":7,"name":"Yam Koo","recruitment":"Joins along with Tai Ho."},{"id":8,"name":"Luc","recruitment":"Joins automatically at Toran Castle."},{"id":9,"name":"Chandler","recruitment":"Talk to him at Kwaba Fortress after you acquire your castle."},{"id":10,"name":"Kai","recruitment":"After having set the HQ, Joins when spoken to at the Garan Fortress."},{"id":11,"name":"Lorelai","recruitment":"After having set the HQ, Lorelai joins Tir in Kouan if he's over level 25 when he talks to her."},{"id":12,"name":"Maas","recruitment":"Joins when spoken to in the Great Forest Kobold Village."},{"id":13,"name":"Marie","recruitment":"Joins when spoken to at the inn in Seika after securing Toran Castle."},{"id":14,"name":"Onil","recruitment":"Joins when spoken to in Seika after exploring Toran Castle."},{"id":15,"name":"Sansuke","recruitment":"Joins when spoken to in Great Forest Village after exploring Toran Castle."},{"id":16,"name":"Sergei","recruitment":"Joins when spoken to in Kaku after exploring Toran Castle."},{"id":17,"name":"Antonio","recruitment":"He joins when Tir speaks to him at the Inn in Seika, after Marie has been recruited and mentions she needs help. You need to sleep or just choose \"don't stay\" a couple of times at your HQ until Marie triggers the dialog that she needs help, then go back see Antonio."},{"id":18,"name":"Rock","recruitment":"Rock joins when spoken to in Kouan in Lepant's mansion."},{"id":19,"name":"Juppo","recruitment":"Joins automatically, after talking to him in Lepant's mansion. Note: If you didn't recruited him while sneaking in Lepant's Mansion, he will automatically be available at the HQ after Lepant joined."},{"id":20,"name":"Meg","recruitment":"After recruiting Juppo, put him in the party to Kaku and talk to her, she will join."},{"id":21,"name":"Lepant","recruitment":"Joins automatically after saving Eileen."},{"id":22,"name":"Eileen","recruitment":"Joins with Lepant."},{"id":23,"name":"Giovanni","recruitment":"Joins with Lepant."},{"id":24,"name":"Krin","recruitment":"Joins automatically during the events in Kouan."},{"id":25,"name":"Pahn","recruitment":"Pahn joins when spoken to after the events in Kouan. At a later point in the game, Pahn must duel Teo McDohl. If Pahn is defeated in the duel, then he will be technically killed in the story. The player must keep his weapon properly sharpened and have Pahn higher than level 30 with good equipment in order to increase the possibility of winning the duel."},{"id":26,"name":"Gaspar","recruitment":"Joins if Tir wins 5000 potch off of him in Chinchirorin."},{"id":27,"name":"Varkas","recruitment":"Joins automatically with Sydonia in Toran Castle after the events in Kouan."},{"id":28,"name":"Sydonia","recruitment":"Joins automatically with Varkas in Toran Castle after events in Kouan."},{"id":29,"name":"Kirkis","recruitment":"Joins automatically after events in Pannu Yakuta."},{"id":30,"name":"Sheena","recruitment":"Joins when spoken to with Lepant in the party at the Inn in Seika."},{"id":31,"name":"Viki","recruitment":"She will appear in the Forest trail, in Great Forest Village, ask her to join."},{"id":32,"name":"Meese","recruitment":"Speak to him in the Village of the Dwarves after recruiting Maas and he will join."},{"id":33,"name":"Valeria","recruitment":"Joins automatically after the events in Pannu Yakuta."},{"id":34,"name":"Templeton","recruitment":"Joins when spoken to at the burned Village of the Elves."},{"id":35,"name":"Kuromimi","recruitment":"Joins automatically after the events at Pannu Yakuta."},{"id":36,"name":"Humphrey","recruitment":"Joins automatically after the original remaining members from the Liberation Army meet up at the new Headquarters."},{"id":37,"name":"Kwanda","recruitment":"After defeating Kwanda in a duel in Pannu Yakuta, choose the following choices: \"Something's wrong.\" and \"I want you to join us.\""},{"id":38,"name":"Sylvina","recruitment":"Joins automatically after events at Pannu Yakuta."},{"id":39,"name":"Stallion","recruitment":"Joins automatically after events at Pannu Yakuta."},{"id":40,"name":"Fu Su Lu","recruitment":"Joins if Tir agrees to pay his 10,000 bit food bill at the Inn in the Great Forest Kobold Village."},{"id":41,"name":"Gon","recruitment":"Bring Kuromimi to visit him in the Great Forest Kobold Village and speak to him to recruit him."},{"id":42,"name":"Rubi","recruitment":"Bring Kirkis to speak to Rubi at the Great Forest Kobold Village when Kirkis is Lv. 35 or higher and speak to Rubi to recruit him."},{"id":43,"name":"Apple","recruitment":"Speak to her in Seika and she'll join to find out Mathiu's reason for joining."},{"id":44,"name":"Flik","recruitment":"Joins automatically in Kaku when Viktor and Tir speak to him after events in Pannu Yakuta occur."},{"id":45,"name":"Chapman","recruitment":"Joins when talked to at the Antei Armor store."},{"id":46,"name":"Eikei","recruitment":"Speak to him in Teien when Tir is Lv. 40 or higher."},{"id":47,"name":"Hellion","recruitment":"Joins when spoken to at the Inn in Teien, as long as the castle is level 2 or higher."},{"id":48,"name":"Jabba","recruitment":"Fight Holly Fairies until one drops a Nameless Urn, then speak to Jabba in Rikon with the urn in your inventory to get Jabba to join."},{"id":49,"name":"Jeane","recruitment":"Speak to her in the Rune Shop at Antei. Allow her to join you. Your Castle must be at least Lv. 3."},{"id":50,"name":"Lotte","recruitment":"She is at the inn, inside of Rikon, speak to her. Eventually she will tell you, her cat is missing, if you find her cat, she will join. The cat is in Kaku, you may need the Holy Rune to help catch her. Run after the cat \"Mina\", and when next to her,press the action button."},{"id":51,"name":"Mina","recruitment":"Buy Toe Shoes and equip them to Tir, talk to Mina and she will dance with you, and join you."},{"id":52,"name":"Anji","recruitment":"After the castle is level 3 or higher, take Tai Ho and Yam Koo in a party to the Pirate's Hideout. Defeat the 3 pirates within 5 rounds to recruit them."},{"id":53,"name":"Kanak","recruitment":"Joins alongside Anji and Leonardo when defeated at their hideout. Take Tai Ho and Yam Koo to the Pirate's Hideout once the castle is Level 3 or higher."},{"id":54,"name":"Leonardo","recruitment":"After the castle reaches level 3, take Tai Ho and Yam Koo to the Pirate's Hideout, and upon defeating Anji, Leonardo, and Kanak, they will join."},{"id":55,"name":"Kamandol","recruitment":"Joins automatically alongside Gen during the events to pass the Dunan Rapids."},{"id":56,"name":"Gen","recruitment":"Gen will automatically join when spoken to in a house in Teien when Tir and party need a way to pass the Dunan Rapids."},{"id":57,"name":"Tesla","recruitment":"Joins automatically when spoken to in Antei after Mathiu assigns Tir to recruit him and Kimberley."},{"id":58,"name":"Kimberley","recruitment":"Joins when spoken to at her home in Antei, after Mathiu instructs Tir to recruit her and Tesla."},{"id":59,"name":"Esmeralda","recruitment":"Acquire an Opal from the enemies in Soniere Prison, and give one to Esmeralda, she will then join."},{"id":60,"name":"Liukan","recruitment":"Joins automatically when spoken to in Soniere Prison."},{"id":61,"name":"Milich","recruitment":"After defeating him, say that he is not at fault for killing Gremio and ask him to join.Note: Do not agree with Pahn, Cleo, and Viktor about avenging Gremio."},{"id":62,"name":"Ivanov","recruitment":"Speak with him at Scarleticia Castle after defeating Milich Oppenheimer."},{"id":63,"name":"Kasios","recruitment":"Speak to him in Scarleticia Castle with Milich Oppenheimer in your party."},{"id":64,"name":"Qlon","recruitment":"Qlon joins if you speak to him in Antei after liberating it from Milich Oppenheimer."},{"id":65,"name":"Kasumi","recruitment":"Joins automatically before the first battle with Teo McDohl's army."},{"id":66,"name":"Georges","recruitment":"Talk to him at the inn in Kirov and beat the record in any card game level he offers."},{"id":67,"name":"Lester","recruitment":"In Kirov, enter the houses to the left and right of Sarah and taste the stew on the stove. Then enter the house south of Sarah and talk to him. He will not appear unless Toran Castle is at least Level 3."},{"id":68,"name":"Sarah","recruitment":"Recruting Sarah requires a series of trades with the denizens of Kirov. When Sarah asks for soap, Tir can talk to various villagers to find out what they'll want to trade for. To complete the quest, buy Sugar at the item store. Trade it to the man at the Inn for a yardstick. Trade the yardstick to the villager near Sarah for Salt. Trade the Salt for Soy Sauce with the villager at the Item Shop. Then trade the Soy Sauce to the villager near the Armor Shop for some Soap. Speak to Sarah with soap in hand and she'll join."},{"id":69,"name":"Blackman","recruitment":"Speak to him at Kalekka without stepping on his plants.Note: If you step on his plants before speaking to him, simply exit the village and return."},{"id":70,"name":"Ledon","recruitment":"Speak to him at the Secret Factory."},{"id":71,"name":"Kessler","recruitment":"Speak to him at the Secret Factory."},{"id":72,"name":"Kage","recruitment":"Speak to him at the Secret Factory and pay his 20,000 bit service fee."},{"id":73,"name":"Melodye","recruitment":"Speak to her at Kirov with the Sound Rune in your inventory"},{"id":74,"name":"Kun To","recruitment":"Joins automatically after lending boats to carry the Fire Spears."},{"id":75,"name":"Mose","recruitment":"Joins automatically before delivering the Fire Spears."},{"id":76,"name":"Ronnie Bell","recruitment":"Joins automatically before delivering the Fire Spears."},{"id":77,"name":"Alen","recruitment":"Joins automatically with Grenseal after defeating General Teo."},{"id":78,"name":"Grenseal","recruitment":"Joins automatically with Alen after defeating General Teo."},{"id":79,"name":"Kirke","recruitment":"Joins when spoken to at the Lorimar checkpoint after the events there make the area available."},{"id":80,"name":"Marco","recruitment":"Play his game and win 5,000 Bits from him in the Warrior's Village."},{"id":81,"name":"Moose","recruitment":"Speak to him in the weapon shop at the Warrior's Village with Maas, Meese, and Mose in your active party."},{"id":82,"name":"Morgan","recruitment":"Speak to him at Qlon Temple if your Castle is at least Level 3 and allow him to join the army, otherwise he will say he needs more training."},{"id":83,"name":"Zen","recruitment":"Joins upon request at Qlon Temple if you bring him Blue, Red, and Yellow Flower Seeds."},{"id":84,"name":"Quincy","recruitment":"Speak to him at the Garan Fortress with at least 80 recruits (dead and \"away\" characters do not count)."},{"id":85,"name":"Fukien","recruitment":"Joins automatically after you enter Qlon Temple."},{"id":86,"name":"Hugo","recruitment":"Speak to him at the Qlon Temple with the War Scroll in your inventory. He will not accept it unless your Castle is at least Level 3."},{"id":87,"name":"Window","recruitment":"Bring him the Window crystal, that is found in the Cave of Past, in Qlon Temple."},{"id":88,"name":"Tengaar","recruitment":"Automatically joins after rescuing her from Neclord's Castle."},{"id":89,"name":"Hix","recruitment":"Joins automatically before entering Neclord's Castle."},{"id":90,"name":"Fuma","recruitment":"Speak to him at the Dragon Knights' Fortress and allow him to join the party. Note: He is at the upper-right of the first screen of the fortress, and he will not appear unless your Castle is at least Level 3."},{"id":91,"name":"Crowley","recruitment":"Prerequisites: Level 4 HeadquartersTo recruit Crowley, speak to him in a secret passage in the Cave of the Past. To get to the secret passage, once inside the cave take the north exit and head down the stairs. Head all the way to the right, and then south to a new screen. Start heading right and go south. Head up the stairs and you will be in the previous screen. Take the stairs down and head south to the next screen, and then head south once more. The hidden passage is against the southern wall."},{"id":92,"name":"Pesmerga","recruitment":"Prerequisites: Level 4 HeadquartersIn order to recruit Pesmerga, speak with him on the top floor of Neclord's Castle."},{"id":93,"name":"Clive","recruitment":"Joins when spoken to when he appears at the Inn in Rikon. He appears there at random starting after events in Lorimar."},{"id":94,"name":"Leon","recruitment":"Speak to him in the house at Kalekka after attaining a Level 4 HQ. He will mention how impressive the Liberation Army has become. Speak to Mathiu at HQ and receive a letter. Deliver the letter to Leon and he will join."},{"id":95,"name":"Kreutz","recruitment":"Speak to him at the Dragon's Den with Humphrey in the active party."},{"id":96,"name":"Joshua","recruitment":"Joins automatically after returning from Seek Valley."},{"id":97,"name":"Milia","recruitment":"Joins automatically before heading to Seek Valley."},{"id":98,"name":"Futch","recruitment":"Joins automatically after returning from Seek Valley."},{"id":99,"name":"Taggart","recruitment":"Joins automatically after informing him of Warren's capture."},{"id":100,"name":"Mace","recruitment":"Speak to him at Seek Valley with Maas, Meese, Moose and Mose in your active party. A Level 4 Headquarters is required before recruiting him."},{"id":101,"name":"Griffith","recruitment":"Is recruited automatically after defeating him at the Northern Checkpoint, regardless of the player's choice."},{"id":102,"name":"Warren","recruitment":"Joins automatically after the events at Moravia Castle."},{"id":103,"name":"Kasim","recruitment":"Joins automatically after the events at Moravia Castle."},{"id":104,"name":"Vincent","recruitment":"After rescuing Warren and Viktor, go back to Kasim's prison and talk to Vincent."},{"id":105,"name":"Maximillian","recruitment":"Joins upon request at the Northern Checkpoint after rescuing Warren and Viktor."},{"id":106,"name":"Sancho","recruitment":"Joins with Maximillian at the Northern Checkpoint after rescuing Warren and Viktor."},{"id":107,"name":"Sonya Schulen","recruitment":"After the mission at Shasarazade, speak to her in the dungeon at HQ. Request her assistance."}]